BeagleBinary/PocketBeagle_Gateway/example/cc13xx-sbl/cc13xxdnld/cc13xxdnld.c
/******************************************************************************

 @file cc13xxdnld.c

 @brief API for downloading to the CC13/26xx Flash using the ROM
        Bootloader

 Group: WCS LPC
 $Target Device: DEVICES $

 ******************************************************************************
 $License: BSD3 2016 $
 ******************************************************************************
 $Release Name: PACKAGE NAME $
 $Release Date: PACKAGE RELEASE DATE $
 *****************************************************************************/

//*****************************************************************************
//
// Copyright (C) 2014 Texas Instruments Incorporated - http://www.ti.com/
//
//
//  Redistribution and use in source and binary forms, with or without
//  modification, are permitted provided that the following conditions
//  are met:
//
//      Redistributions of source code must retain the above copyright
//      notice, this list of conditions and the following disclaimer.
//
//      Redistributions in binary form must reproduce the above copyright
//      notice, this list of conditions and the following disclaimer in the
//      documentation and/or other materials provided with the
//      distribution.
//
//      Neither the name of Texas Instruments Incorporated nor the names of
//      its contributors may be used to endorse or promote products derived
//      from this software without specific prior written permission.
//
//  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
//  "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
//  LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
//  A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT
//  OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,
//  SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
//  LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
//  DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
//  THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
//  (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
//  OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
//
//*****************************************************************************

#include <stdio.h>
#include <stdbool.h>
#include <stdlib.h>
#include <string.h>

#include <sys/time.h>

#include "cc13xxdnld.h"

/* \brief CcDnld SBL Commands */
typedef enum
{
    CCDNLD_CMD_PING                 = 0x20,
    CCDNLD_CMD_DOWNLOAD             = 0x21,
    CCDNLD_CMD_GET_STATUS           = 0x23,
    CCDNLD_CMD_SEND_DATA            = 0x24,
    CCDNLD_CMD_RESET                = 0x25,
    CCDNLD_CMD_SECTOR_ERASE         = 0x26,
    CCDNLD_CMD_CRC32                = 0x27,
    CCDNLD_CMD_GET_CHIP_ID          = 0x28,
    CCDNLD_CMD_MEMORY_READ          = 0x2A,
    CCDNLD_CMD_MEMORY_WRITE         = 0x2B,
    CCDNLD_CMD_BANK_ERASE           = 0x2C,
    CCDNLD_CMD_SET_CCFG             = 0x2D,
    CCDNLD_CMD_RET_SUCCESS          = 0x40,
    CCDNLD_CMD_RET_UNKNOWN_CMD      = 0x41,
    CCDNLD_CMD_RET_INVALID_CMD      = 0x42,
    CCDNLD_CMD_RET_INVALID_ADR      = 0x43,
    CCDNLD_CMD_RET_FLASH_FAIL       = 0x44,
} CcDnld_Commands;

/* \brief CcDnld SBL Ack's */
typedef enum
{
    CCDNLD_DEVICE_ACK               = 0xCC,
    CCDNLD_DEVICE_NACK              = 0x33,
} CcDnld_Dev_Ack;

static CcDnld_UartFxns_t* uartFxns;

static uint8_t generateCheckSum(uint8_t cmdId, const uint8_t *pData, uint32_t dataLen);
static CcDnld_Status sendCmd(uint8_t cmdId, const uint8_t *pSendData, uint32_t sendLen);
static CcDnld_Status getCmdResponse(CcDnld_Dev_Ack* bAck);
static CcDnld_Status getResponseData(uint8_t *pData, uint32_t *maxLen);
static CcDnld_Status sendCmdResponse(CcDnld_Dev_Ack bAck);
static CcDnld_Status readStatus(uint8_t *status);
static void ui32ToByteArray(uint32_t src, uint8_t *pDst);
static void byteArrayToUi32(const uint8_t* pSrc, uint32_t *pDst);
static CcDnld_Status addressInFlash(uint32_t startAddress, uint32_t byteCount, char * deviceType);
static uint32_t calcVarifyCrc(const uint8_t *pData, uint32_t byteCount);

//*****************************************************************************
//
//! \brief Initialises UART function pointer table.
//!
//! This function initializes the UART functions for sending SBL commands to the
//! CC13/26xx
//!
//! \param uartFxns - The UART function pioiter table.
//!
//! \return CcDnld_Status
//
//*****************************************************************************
void CcDnld_init(CcDnld_UartFxns_t* ccDnld_uartFxns)
{
    uartFxns = ccDnld_uartFxns;
}

//*****************************************************************************
//
//! \brief Establishes a connnection with the ROM Bootloader.
//!
//! This function establishes a connnection with the ROM Bootloader by setting
//! the autoboard rate. By sending 0x55 the CC163/26xx ROM bootloader uses the
//! alternating 0's/1's to detect the board rate and sends an Ack/0xCC in
//! response
//!
//! \param None.
//!
//! \return CcDnld_Status
//
//*****************************************************************************
CcDnld_Status CcDnld_connect()
{
    CcDnld_Dev_Ack devAck = 0;

    /* Send 0x55 0x55 and expect ACK */
    uartFxns->sbl_UartWriteByte(0x55);
    uartFxns->sbl_UartWriteByte(0x55);

    if(getCmdResponse(&devAck) != CcDnld_Status_Success)
    {
         return CcDnld_Status_Cmd_Error;
    }

    return CcDnld_Status_Success;
}

//*****************************************************************************
//
//! \brief Determines the deviceId for specific # pages and page size.
//!
//! This function requires an existing connection with the ROM Bootloader by 
//! calling CcDnld_connect(). After the connection has been made successfully 
//! this function can request the deviceId from the ROM Bootloader. This 
//! deviceId can then be used in partnership with the CCDNLD_CCX[0/2]_DEV_ID
//! constants to choose the correct CCDNLD_CC13X[0/2]_PAGE_SIZE and 
//! CCDNLD_CC13X[0/2]_NUM_PAGES in your application logic.
//!
//! \param deviceId - pointer to store the ROM Bootloader's deviceId.
//!
//! \return CcDnld_Status
//
//*****************************************************************************
CcDnld_Status CcDnld_determineDeviceId(uint32_t *deviceId)
{
    CcDnld_Status retCode = CcDnld_Status_Success;
    CcDnld_Dev_Ack devAck = 0;
    uint8_t retBuffer[4];

    /* Send command */
    if((retCode = sendCmd(CCDNLD_CMD_GET_CHIP_ID, 0, 0)) != CcDnld_Status_Success)
    {
        return retCode;
    }

    /* Receive command response (ACK/NAK) */
    if((retCode = getCmdResponse(&devAck)) != CcDnld_Status_Success)
    {
        return retCode;
    }

   if(devAck != CCDNLD_DEVICE_ACK)
    {
        return CcDnld_Status_Cmd_Error;
    }

