BeagleBinary/PocketBeagle_Gateway/example/cc13xx-sbl/cc13xxdnld/cc13xxdnld.c
    /* Receive command response data */
    uint32_t numBytes = 4;
    if((retCode = getResponseData(retBuffer, &numBytes)) != CcDnld_Status_Success)
    {
            //
            // Respond with NAK
            //
            sendCmdResponse(CCDNLD_DEVICE_NACK);
            return retCode;
    }

    /* Respond with ACK */
    sendCmdResponse(CCDNLD_DEVICE_ACK);

    byteArrayToUi32(retBuffer, deviceId);

    return CcDnld_Status_Success;
}

//*****************************************************************************
//
//! \brief Gets the number of pages needing to be erased Erases the specified page.
//!
//! This function gets the number of pages needing to be erased based on Flash start address
//! and the Bytes to be written
//!
//! \param startAddress - The Flash start address.
//! \param byteCount        - Number of bytes to be erased.
//!
//! \return CcDnld_Status
//
//*****************************************************************************
CcDnld_Status CcDnld_flashEraseRange(uint32_t startAddress, uint32_t byteCount, char * deviceType)
{
    uint8_t eraseAddress[4];
    uint32_t pageIdx;
    uint32_t pageCount;
    uint32_t retCode = CcDnld_Status_Success;
    CcDnld_Dev_Ack devAck;
    uint8_t devStatus;

    uint32_t pageSize = CcDnld_getPageSize(deviceType);

    pageCount = byteCount / pageSize;
    if(byteCount % pageSize) pageCount ++;

    for(pageIdx = 0; pageIdx < pageCount; pageIdx++)
    {
        /* Build payload - 4B address (MSB first) */
        ui32ToByteArray(startAddress + pageIdx*(pageSize), &eraseAddress[0]);
        /* Send command */
        if((retCode = sendCmd(CCDNLD_CMD_SECTOR_ERASE, eraseAddress, 4)) != CcDnld_Status_Success)
        {
            return retCode;
        }

        /* Receive command response (ACK/NAK) */
        if((retCode = getCmdResponse(&devAck)) != CcDnld_Status_Success)
        {
            return retCode;
        }
        if(devAck != CCDNLD_DEVICE_ACK)
        {
            return CcDnld_Status_Cmd_Error;
        }

        /* Check device status (Flash failed if page(s) locked) */
        readStatus(&devStatus);
        if(devStatus != CCDNLD_CMD_RET_SUCCESS)
        {
            return CcDnld_Status_State_Error;
        }
    }

    return retCode;
}

//*****************************************************************************
//
//! \brief Starts the download to the CC13/26xx ROM bootloader.
//!
//! This function starts the download to the CC13/26xx ROM Bootloader
//!
//! \param startAddress - The Flash start address.
//! \param byteCount        - Total Number of bytes to be programmed.
//!
//! \return CcDnld_Status
//
//*****************************************************************************
CcDnld_Status CcDnld_startDownload(uint32_t address, uint32_t size,  char * deviceType)
{
    CcDnld_Status retCode = CcDnld_Status_Success;
    CcDnld_Dev_Ack devAck;
    uint8_t devStatus;

    /* Check input arguments */
    if(addressInFlash(address, size, deviceType) != CcDnld_Status_Success)
    {
        return CcDnld_Status_Param_Error;
    }

    /*
       Generate payload
       - 4B Program address
       - 4B Program size
    */
    uint8_t pPayload[8];
    ui32ToByteArray(address, &pPayload[0]);
    ui32ToByteArray(size, &pPayload[4]);

    /* Send command */
    if((retCode = sendCmd(CCDNLD_CMD_DOWNLOAD, pPayload, 8)) != CcDnld_Status_Success)
    {
        return retCode;
    }

    /* Receive command response (ACK/NAK) */
    if((retCode = getCmdResponse(&devAck)) != CcDnld_Status_Success)
    {
        return retCode;
    }

    /* Check device status */
    devStatus = 0;
    readStatus(&devStatus);
    if(devStatus != CCDNLD_CMD_RET_SUCCESS)
    {
        return CcDnld_Status_State_Error;
    }

    /* Return command response */
    return (devAck == CCDNLD_DEVICE_ACK) ? CcDnld_Status_Success : CcDnld_Status_Cmd_Error;
}

//*****************************************************************************
//
//! \brief Loads a chunk of data into the CC13/26xx Flash.
//!
//! This function Loads a chunk of data into the CC13/26xx Flash thorugh the
//! ROM bootloader
//!
//! \param startAddress - The Flash start address.
//! \param pData                        - Pointer to a buffer containing the data.
//! \param byteCount        - Number of bytes to be programmed.
//!
//! \return CcDnld_Status
//
//*****************************************************************************
CcDnld_Status CcDnld_sendData(uint8_t *pData, uint32_t byteCount)
{
    CcDnld_Status retCode = CcDnld_Status_Success;
    CcDnld_Dev_Ack devAck;
    uint8_t devStatus;

    /* Check input arguments */
    if(byteCount > CCDNLD_MAX_BYTES_PER_TRANSFER)
    {
            return CcDnld_Status_Param_Error;
    }

    /* Send command */
    if((retCode = sendCmd(CCDNLD_CMD_SEND_DATA, pData, byteCount)) !=
                                                         CcDnld_Status_Success)
    {
        return retCode;
    }

    /* Receive command response (ACK/NAK) */
    if((retCode = getCmdResponse(&devAck)) != CcDnld_Status_Success)
    {
        return retCode;
    }
    if(devAck != CCDNLD_DEVICE_ACK)
    {
        return CcDnld_Status_Cmd_Error;
    }

    devStatus = 0;

    /* Check device status */
    readStatus(&devStatus);
    if(devStatus != CCDNLD_CMD_RET_SUCCESS)
    {
        return CcDnld_Status_State_Error;
    }

    return CcDnld_Status_Success;
}

//*****************************************************************************
//
//! \brief Loads a chunk of data into the CC13/26xx Flash.
//!
//! This function Loads a chunk of data into the CC13/26xx Flash thorugh the
//! ROM bootloader
//!
//! \param dataAddress  - start address of data in Flash to be verified.
//! \param pData                - Pointer to a buffer containing the data to be
//!                                             verified.
//! \param byteCount        - Number of bytes to be programmed.
//!
//! \return CcDnld_Status
//
//*****************************************************************************
CcDnld_Status CcDnld_verifyData(uint32_t dataAddress, uint8_t *pData,
                                                            uint32_t byteCount)
{
    uint32_t localCrc;
    uint32_t targetCrc;
    uint8_t crcCommandPayload[12];
    uint8_t crcCommandResp[4];
    CcDnld_Dev_Ack devAck = 0;
    CcDnld_Status retCode;

