BeagleBinary/PocketBeagle_Gateway/example/cc13xx-sbl/cc13xxdnld/cc13xxdnld.c
    /*
       Build CRC command payload (MSB first)
       - 4B Start address
       - 4B Size
       - 4B Repeat count (0)
    */
    ui32ToByteArray(dataAddress, &crcCommandPayload[0]);
    ui32ToByteArray(byteCount, &crcCommandPayload[4]);
    ui32ToByteArray(0, &crcCommandPayload[8]);

    /* Send command */
    if((retCode = sendCmd(CCDNLD_CMD_CRC32, crcCommandPayload, 12)) !=
                                                         CcDnld_Status_Success)
    {
        return retCode;
    }

    /* Receive command response (ACK/NAK) */
    if((retCode = getCmdResponse(&devAck)) != CcDnld_Status_Success)
    {
        return retCode;
    }

    if(devAck != CCDNLD_DEVICE_ACK)
    {
        return CcDnld_Status_Cmd_Error;
    }

    /* Receive command response data */
    uint32_t numBytes = 4;
    if((retCode = getResponseData(crcCommandResp, &numBytes)) !=
                                                         CcDnld_Status_Success)
    {
        /* Respond with NAK */
        sendCmdResponse(CCDNLD_DEVICE_NACK);
        return retCode;
    }

    /* Respond with ACK */
    sendCmdResponse(CCDNLD_DEVICE_ACK);

    byteArrayToUi32(crcCommandResp, &targetCrc);
    localCrc = calcVarifyCrc(pData, byteCount);

    if(localCrc != targetCrc)
    {
        return CcDnld_Status_Crc_Error;
    }

    return CcDnld_Status_Success;
}

/** \brief Utility function to obtain the page size based on the targets device type.
 *
 * \param[in] deviceType
 *          String containing the device type [cc13x0, cc13x2, cc26x0, cc26x2]
 * \return
 *          uint32_t pageSize - The flash page size for the target device type, 0 if Id not found.
 */
uint32_t CcDnld_getPageSize(char * deviceType)
{
    uint32_t pageSize;

    /* Get page size */
    if((strcmp(deviceType, "cc13x0") == 0) || (strcmp(deviceType, "cc26x0") == 0))
    {
        pageSize = CCDNLD_CC13X0_PAGE_SIZE;
    }
    else if((strcmp(deviceType, "cc13x2") == 0) || (strcmp(deviceType, "cc26x2") == 0))
    {
        pageSize = CCDNLD_CC13X2_PAGE_SIZE;
    }
    else {
        /* Invalid device type */
        pageSize= 0;
    }
    return (pageSize);
}


/** \brief Utility function to obtain the number of available pages based on the targets device type.
 *
 * \param[in] deviceType
 *          String containing the device type [cc13x0, cc13x2, cc26x0, cc26x2]
 * \return
 *          uint32_t numPages - The number of available flash pages for the target device type, 0 if Id not found.
 */
uint32_t CcDnld_getNumPages(char * deviceType)
{
    uint32_t numPages;

    /* Get number of pages supported */
    if((strcmp(deviceType, "cc13x0") == 0) || (strcmp(deviceType, "cc26x0") == 0))
    {
        numPages = CCDNLD_CC13X0_NUM_PAGES;
    }
    else if((strcmp(deviceType, "cc13x2") == 0) || (strcmp(deviceType, "cc26x2") == 0))
    {
        numPages = CCDNLD_CC13X2_NUM_PAGES;
    }
    else {
        /* Invalid device type */
        numPages= 0;
    }
    return (numPages);
}

/*
 * Private Helper Functions
 *
 */

/** \brief This function caclualtes the flash checksum
 *
 * \param[in] pData
 *          pointer to the data buffer
 * \param[in] byteCount
 *          length of data buffer.
 *
 * \return
 *          Returns CcDnld_Status_Success, ...
 */
static uint32_t calcVarifyCrc(const uint8_t *pData, uint32_t byteCount)
{
    uint32_t d, ind;
    uint32_t acc = 0xFFFFFFFF;
    const uint32_t crcRand32Lut[] =
    {
        0x00000000, 0x1DB71064, 0x3B6E20C8, 0x26D930AC,
        0x76DC4190, 0x6B6B51F4, 0x4DB26158, 0x5005713C,
        0xEDB88320, 0xF00F9344, 0xD6D6A3E8, 0xCB61B38C,
        0x9B64C2B0, 0x86D3D2D4, 0xA00AE278, 0xBDBDF21C
    };

    while (byteCount--)
    {
        d = *pData++;
        ind = (acc & 0x0F) ^ (d & 0x0F);
        acc = (acc >> 4) ^ crcRand32Lut[ind];
        ind = (acc & 0x0F) ^ (d >> 4);
        acc = (acc >> 4) ^ crcRand32Lut[ind];
    }

    return (acc ^ 0xFFFFFFFF);
}

/** \brief This function caclualtes the command checksum
 *
 * \param[in] cmdId
 *          The Command ID
 * \param[in] pData
 *          pointer to the data buffer
 * \param[in] dataLen
 *          length of data buffer.
 *
 * \return
 *          Returns CcDnld_Status_Success, ...
 */
static uint8_t generateCheckSum(uint8_t cmdId, const uint8_t *pData,
                                                              uint32_t dataLen)
{
    uint8_t checkSum = cmdId;
    uint32_t i;

    for(i = 0; i < dataLen; i++)
    {
            checkSum += pData[i];
    }

    return checkSum;
}

/** \brief This function sends a command
 *
 * \param[in] cmdId
 *          The Command ID
 * \param[in] pSendData
 *          pointer to the data buffer
 * \param[in] sendLen
 *          length of data buffer.
 *
 * \return
 *          Returns CcDnld_Status_Success, ...
 */
static CcDnld_Status sendCmd(uint8_t cmdId, const uint8_t *pSendData,
                                                uint32_t sendLen)
{
    uint8_t pktLen = sendLen + 3; // +3 => <1b Length>, <1B cksum>, <1B cmd>
    uint8_t pktSum = generateCheckSum(cmdId, pSendData, sendLen);
    uint32_t i;

    /* Send packet */
    uartFxns->sbl_UartWriteByte(pktLen);
    uartFxns->sbl_UartWriteByte(pktSum);
    uartFxns->sbl_UartWriteByte(cmdId);

    for(i=0;i<sendLen;i++)
    {
        uartFxns->sbl_UartWriteByte(*(pSendData+i));
    }

    uartFxns->sbl_UartWriteByte(0);

    return CcDnld_Status_Success;
}

/** \brief Get ACK/NAK from the CC26xx/13xx device.
 *
 * \param[out] bAck
 *          CCDNLD_DEVICE_ACK or CCDNLD_DEVICE_NACK
 *
 * \return
 *          Returns CcDnld_Status_Success, ...
 */
static CcDnld_Status getCmdResponse(CcDnld_Dev_Ack* bAck)
{
    uint8_t pIn[2];
    uint32_t recvData = 0;
    uint32_t bytesRecv = 0;

    /* Expect 2 bytes (ACK or NAK) */
    do
    {
        recvData = uartFxns->sbl_UartReadByte();
        if((recvData&0x00000500) == 0)
        {
            pIn[bytesRecv]=(uint8_t) recvData;
            bytesRecv += 1;
        }
    }
    while(bytesRecv < 2);

    if((bytesRecv >= 2) &&
            (pIn[0] == 0x00 &&
            (pIn[1] == CCDNLD_DEVICE_ACK || pIn[1] == CCDNLD_DEVICE_NACK)))
    {
            *bAck = pIn[1];
            return CcDnld_Status_Success;
    }

    return CcDnld_Status_Cmd_Error;
}

/** \brief Get response data from CC13x/26xx device.
 *
 * \param[out] pData
 *          Pointer to where received data is stored.
 * \param[in|out] maxLen
 *          Max number of bytes that can be received. Is populated with the
 *          actual number of bytes received.
 * \return
 *          Returns CcDnld_Status_Success, ...
 */
static CcDnld_Status getResponseData(uint8_t *pData, uint32_t *maxLen)
{
    uint8_t pHdr[2];
    uint32_t numPayloadBytes;
    uint8_t hdrChecksum, dataChecksum;
    uint32_t bytesRecv = 0;

    /* Read length and checksum */
    do
    {
     pHdr[bytesRecv]=(uint8_t) uartFxns->sbl_UartReadByte();
     bytesRecv += 1;
    }
    while(bytesRecv < 2);

    numPayloadBytes = pHdr[0]-2;
    hdrChecksum = pHdr[1];

    /* Check if length byte is too long. */
    if(numPayloadBytes > *maxLen)
    {
        return CcDnld_Status_Cmd_Error;
    }

