BeagleBinary/PocketBeagle_Gateway/example/cc13xx-sbl/cc13xxdnld/cc13xxdnld.c
    /* Read the payload data */
    bytesRecv = 0;

    do
    {
        *(pData + bytesRecv) = (uint8_t) uartFxns->sbl_UartReadByte();
        bytesRecv++;
    }
    while(bytesRecv < numPayloadBytes);

    /* Verify data checksum */
    dataChecksum = generateCheckSum(0, pData, numPayloadBytes);
    if(dataChecksum != hdrChecksum)
    {
        return CcDnld_Status_Cmd_Error;
    }

    *maxLen = bytesRecv;
    return CcDnld_Status_Success;
}

/** \brief Send command response (ACK/NAK) to CC13x/26xx device.
 *
 * \param[in] bAck
 *          True if response is ACK, false if response is NAK.
 * \return
 *          Returns CcDnld_Status_Success, ...
 */
static CcDnld_Status sendCmdResponse(CcDnld_Dev_Ack bAck)
{

        /* Send response */
        uartFxns->sbl_UartWriteByte(0x00);
        uartFxns->sbl_UartWriteByte(bAck);

        return CcDnld_Status_Success;
}

//-----------------------------------------------------------------------------
/** \brief Get status from device.
 *
 * \param[out] pStatus
 *          Pointer to where status is stored.
 * \return
 *          Returns CcDnld_Status_Success, ...
 */
//-----------------------------------------------------------------------------
static CcDnld_Status readStatus(uint8_t *status)
{
    CcDnld_Status retCode;
    CcDnld_Dev_Ack devAck;

    /* Send command */
    if((retCode = sendCmd(CCDNLD_CMD_GET_STATUS,0,0)) != CcDnld_Status_Success)
    {
        return retCode;
    }

    /* Receive command response */
    if((retCode = getCmdResponse(&devAck)) != CcDnld_Status_Success)
    {
        return retCode;
    }

    if(devAck != CCDNLD_DEVICE_ACK)
    {
        return CcDnld_Status_Cmd_Error;
    }

    /* Receive command response data */
    uint32_t numBytes = 1;
    if((retCode = getResponseData(status, &numBytes)) != CcDnld_Status_Success)
    {
            //
            // Respond with NAK
            //
            sendCmdResponse(CCDNLD_DEVICE_NACK);
            return retCode;
    }

    /* Respond with ACK */
    sendCmdResponse(CCDNLD_DEVICE_ACK);

    return CcDnld_Status_Success;
}

/** \brief Utility function for splitting 32 bit variable into uint8_t array
 *          (4 elements). Data are converted MSB, ie. \e pcDst[0] is the
 *          most significant byte.
 *
 * \param[in] src
 *          The 32 bit variable to convert.
 * \param[out] pDst
 *          Pointer to the uint8_t array where the data is stored.
 *
 * \return
 *          void
 */
static void ui32ToByteArray(uint32_t src, uint8_t *pDst)
{
        /* MSB first */
        pDst[0] =    (uint8_t)(src >> 24);
        pDst[1] =    (uint8_t)(src >> 16);
        pDst[2] =    (uint8_t)(src >> 8);
        pDst[3] =    (uint8_t)(src >> 0);
}

/** \brief Utility function for converting uint8_t array into 32 bit variable
 *          (4 elements). Data are converted MSB, ie. \e pcDst[0] is the
 *          most significant byte.
 *
 * \param[in] pSrc
 *          The 32 bit variable to convert.
 * \param[out] pDst
 *          Pointer to the uint8_t array where the data is stored.
 *
 * \return
 *          void
 */
static void byteArrayToUi32(const uint8_t* pSrc, uint32_t *pDst)
{
        *pDst = (pSrc[0] << 24) & 0xFF000000;
        *pDst |= (pSrc[1] << 16) & 0x00FF0000;
        *pDst |= (pSrc[2] << 8) & 0x0000FF00;
        *pDst |= pSrc[3] & 0x000000FF;
}

/** \brief This function checks if the specified startAddress (and range)
 *          is located within the device flash.
 *
 * \return
 *          Returns CcDnld_Status_Success if the address/range is within the device
 *          flash.
 */
static CcDnld_Status addressInFlash(uint32_t startAddress, uint32_t byteCount, char * deviceType)
{
    uint32_t endAddr = startAddress + byteCount;

    uint32_t pageSize = CcDnld_getPageSize(deviceType);
    uint32_t numPages = CcDnld_getNumPages(deviceType);

    if(startAddress < CCDNLD_FLASH_START_ADDRESS)
    {
        return CcDnld_Status_Param_Error;
    }
    if(endAddr > (CCDNLD_FLASH_START_ADDRESS + (pageSize * numPages)))
    {
        return CcDnld_Status_Param_Error;
    }

    return CcDnld_Status_Success;
}

/*
 *  ========================================
 *  Texas Instruments Micro Controller Style
 *  ========================================
 *  Local Variables:
 *  mode: c
 *  c-file-style: "bsd"
 *  tab-width: 4
 *  c-basic-offset: 4
 *  indent-tabs-mode: nil
 *  End:
 *  vim:set  filetype=c tabstop=4 shiftwidth=4 expandtab=true
 */

